# EnergyAnalysisDetailModelOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EnergyAnalysisDetailModelOptions Members
EnergyAnalysisDetailModelOptions Class Constructors Methods Properties See Also
---
The EnergyAnalysisDetailModelOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EnergyAnalysisDetailModelOptions | Constructs default options for energy analysis detailed model creation. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the EnergyAnalysisDetailModelOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EnergyModelType | It indicates whether the energy model is based on rooms/spaces or building elements. |
| ExportMullions | Indicates if to specify the setting for exporting mullions. |
| IncludeShadingSurfaces | Indicates if to set and get the setting for if shading surfaces should be included. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SimplifyCurtainSystems | Indicates if to specify the setting for simplified curtain systems. |
| Tier | Level of computation for energy analysis model. |

# See Also
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace